app/controllers/course_tables_controller.rb

SELECT "course_tables".* FROM "course_tables"
---
  def index
    @course_tables = CourseTable.all

INSERT INTO "course_tables" ("coursename", "teachername", "coursenum", "courseroom", "avaliablenums", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @course_table = CourseTable.new(course_table_params)

    respond_to do |format|
      if @course_table.save

SELECT  "course_tables".* FROM "course_tables" WHERE "course_tables"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_course_table
      @course_table = CourseTable.find(params[:id])